test/http_recordings/refunds/get_all.json

[
  {
    "request": {
      "body": "\"\"",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/refunds"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":[{\"token\":\"rf_sObj01dDMOFfjhHNP3aEEg\",\"success\":null,\"amount\":50000,\"currency\":\"AUD\",\"charge\":\"ch_NR_Kkm_ZLp7JWNzKgDX6bw\",\"created_at\":\"2018-05-23T01:50:55Z\",\"error_message\":null,\"status_message\":\"Pending\"},{\"token\":\"rf_djFwf03PLpp4G7cGEr_5mg\",\"success\":null,\"amount\":100,\"currency\":\"AUD\",\"charge\":\"ch_lENRObt9AvXvuUszuq5FBA\",\"created_at\":\"2015-11-15T08:50:55Z\",\"error_message\":null,\"status_message\":\"Pending\"},{\"token\":\"rf_HWV4-cB6UNlh_Tdc5ZaC8g\",\"success\":null,\"amount\":500,\"currency\":\"AUD\",\"charge\":\"ch_NCoA7oBzrycXEPBTEUWNdQ\",\"created_at\":\"2015-11-15T08:49:46Z\",\"error_message\":null,\"status_message\":\"Pending\"},{\"token\":\"rf_SURNqQ-saP8ykP_2AiONhw\",\"success\":null,\"amount\":2000,\"currency\":\"AUD\",\"charge\":\"ch_wQWXpjW4wX_RwcU0ZXB7xw\",\"created_at\":\"2015-11-15T05:06:33Z\",\"error_message\":null,\"status_message\":\"Pending\"},{\"token\":\"rf_adeypr12eGBH1Df2_UAl2Q\",\"success\":null,\"amount\":3,\"currency\":\"AUD\",\"charge\":\"ch_ptCl8pvS7x8ivaJ6_uskXg\",\"created_at\":\"2015-11-15T04:53:55Z\",\"error_message\":null,\"status_message\":\"Pending\"},{\"token\":\"rf_e78DJ9TgUhpBIMl7SQigtg\",\"success\":null,\"amount\":500,\"currency\":\"AUD\",\"charge\":\"ch_Jsb8IdWW0mL7RVQcXVFRdg\",\"created_at\":\"2015-11-15T04:51:23Z\",\"error_message\":null,\"status_message\":\"Pending\"},{\"token\":\"rf_Tn_az7n_8rMEfl82yiIpVA\",\"success\":null,\"amount\":500,\"currency\":\"AUD\",\"charge\":\"ch_JFbX45QT6LVRXUxfu3vKKw\",\"created_at\":\"2015-11-15T04:49:53Z\",\"error_message\":null,\"status_message\":\"Pending\"},{\"token\":\"rf_b1PcKy0gxG6nmNl6ttmoGg\",\"success\":null,\"amount\":500,\"currency\":\"AUD\",\"charge\":\"ch_ImfPyVgDXzIlgaX2TO4xAg\",\"created_at\":\"2015-11-15T04:46:49Z\",\"error_message\":null,\"status_message\":\"Pending\"},{\"token\":\"rf_jTObyMmPfyujgIFqsgmU0Q\",\"success\":null,\"amount\":500,\"currency\":\"AUD\",\"charge\":\"ch_KGIRhyKk32cRIQT9xIZLyA\",\"created_at\":\"2015-11-15T04:44:39Z\",\"error_message\":null,\"status_message\":\"Pending\"},{\"token\":\"rf_-IrsvLH6OURZBlnwWqLeNQ\",\"success\":null,\"amount\":500,\"currency\":\"AUD\",\"charge\":\"ch_K9xgAZcx_Ki-xFIyVYKASw\",\"created_at\":\"2015-11-15T04:39:44Z\",\"error_message\":null,\"status_message\":\"Pending\"}],\"count\":10,\"pagination\":{\"current\":1,\"previous\":null,\"next\":null,\"per_page\":25,\"pages\":1,\"count\":10}}",
      "headers": {
        "Date": "Wed, 23 May 2018 01:53:36 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "2156",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"8021b5251de851c0817a37bd6c9ae6ea\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "d54d67b6-0408-46a7-8bfa-1144c4c5ebd1",
        "X-Runtime": "0.040686",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]