test/http_recordings/refunds/get_one.json

[
  {
    "request": {
      "body": "{\"transfer\":null,\"total_fees\":null,\"token\":null,\"settlement_currency\":null,\"refund_pending\":null,\"metadata\":null,\"merchant_entitlement\":null,\"ip_address\":\"127.0.0.1\",\"email\":\"hagrid@hogwarts.wiz\",\"description\":\"Dragon eggs\",\"customer_token\":null,\"currency\":null,\"card_token\":null,\"card\":{\"token\":null,\"number\":\"5520000000000000\",\"name\":\"Rubius Hagrid\",\"expiry_year\":\"20\",\"expiry_month\":\"12\",\"cvc\":\"321\",\"address_state\":null,\"address_postcode\":null,\"address_line2\":null,\"address_line1\":\"The Game Keepers Cottage\",\"address_country\":\"England\",\"address_city\":\"Hogwarts\"},\"captured\":null,\"capture\":null,\"authorisation_expired\":null,\"amount_refunded\":null,\"amount\":50000}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":{\"token\":\"ch_SfjmafC4Cd5ZkgPHBSOPHQ\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T02:07:01Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_rUm901rxgAgC3FJPkVCU1Q\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}}}",
      "headers": {
        "Date": "Wed, 23 May 2018 02:07:01 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "820",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"f0e05f10ef0f127b6a14f96da97df950\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "ce7246d2-ae8e-4fdf-8c8a-fb42f3974ca3",
        "X-Runtime": "0.187125",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 201,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "{}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges/ch_SfjmafC4Cd5ZkgPHBSOPHQ/refunds"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":{\"token\":\"rf_R01yJpFR0Dh3cPrzuaxp3w\",\"success\":null,\"amount\":50000,\"currency\":\"AUD\",\"charge\":\"ch_SfjmafC4Cd5ZkgPHBSOPHQ\",\"created_at\":\"2018-05-23T02:07:02Z\",\"error_message\":null,\"status_message\":\"Pending\"}}",
      "headers": {
        "Date": "Wed, 23 May 2018 02:07:02 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "218",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"d9296619a3b7540f1a1fc307806b4b3f\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "17cae73b-a25b-4268-b1e7-c73316369de9",
        "X-Runtime": "0.130717",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 201,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "\"\"",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/refunds/rf_R01yJpFR0Dh3cPrzuaxp3w"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":{\"token\":\"rf_R01yJpFR0Dh3cPrzuaxp3w\",\"success\":null,\"amount\":50000,\"currency\":\"AUD\",\"charge\":\"ch_SfjmafC4Cd5ZkgPHBSOPHQ\",\"created_at\":\"2018-05-23T02:07:02Z\",\"error_message\":null,\"status_message\":\"Pending\"}}",
      "headers": {
        "Date": "Wed, 23 May 2018 02:07:02 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "218",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"d9296619a3b7540f1a1fc307806b4b3f\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "8e77276f-269f-451a-b505-3ecf2d7bb742",
        "X-Runtime": "0.015938",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]