test/http_recordings/refunds/get_refunds_for_charge.json

[
  {
    "request": {
      "body": "{\"transfer\":null,\"total_fees\":null,\"token\":null,\"settlement_currency\":null,\"refund_pending\":null,\"metadata\":null,\"merchant_entitlement\":null,\"ip_address\":\"127.0.0.1\",\"email\":\"hagrid@hogwarts.wiz\",\"description\":\"Dragon eggs\",\"customer_token\":null,\"currency\":null,\"card_token\":null,\"card\":{\"token\":null,\"number\":\"5520000000000000\",\"name\":\"Rubius Hagrid\",\"expiry_year\":\"20\",\"expiry_month\":\"12\",\"cvc\":\"321\",\"address_state\":null,\"address_postcode\":null,\"address_line2\":null,\"address_line1\":\"The Game Keepers Cottage\",\"address_country\":\"England\",\"address_city\":\"Hogwarts\"},\"captured\":null,\"capture\":null,\"authorisation_expired\":null,\"amount_refunded\":null,\"amount\":50000}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":{\"token\":\"ch_kde3n7ahjoc2_dXv69nQ3A\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T02:23:58Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_-ZpmrwCE4bQpcE210vpVbw\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}}}",
      "headers": {
        "Date": "Wed, 23 May 2018 02:23:58 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "820",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"615646fdfb0e2fcb966efa8a5502b74c\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "c8889448-d16d-4bff-8d89-7306696be233",
        "X-Runtime": "0.230322",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 201,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "{}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges/ch_kde3n7ahjoc2_dXv69nQ3A/refunds"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":{\"token\":\"rf_0td78_zG2PlUwSDrAPcPKQ\",\"success\":null,\"amount\":50000,\"currency\":\"AUD\",\"charge\":\"ch_kde3n7ahjoc2_dXv69nQ3A\",\"created_at\":\"2018-05-23T02:23:59Z\",\"error_message\":null,\"status_message\":\"Pending\"}}",
      "headers": {
        "Date": "Wed, 23 May 2018 02:23:59 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "218",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"78980b73f2b95869aad6df74bc212685\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "e17c60cf-9488-44ff-87cf-19a5ed6c1fac",
        "X-Runtime": "0.112257",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 201,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "\"\"",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges/ch_kde3n7ahjoc2_dXv69nQ3A/refunds"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":[{\"token\":\"rf_0td78_zG2PlUwSDrAPcPKQ\",\"success\":null,\"amount\":50000,\"currency\":\"AUD\",\"charge\":\"ch_kde3n7ahjoc2_dXv69nQ3A\",\"created_at\":\"2018-05-23T02:23:59Z\",\"error_message\":null,\"status_message\":\"Pending\"}],\"count\":1,\"pagination\":{\"current\":1,\"previous\":null,\"next\":null,\"per_page\":25,\"pages\":1,\"count\":1}}",
      "headers": {
        "Date": "Wed, 23 May 2018 02:23:59 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "319",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"d7c08c68ffb3626d3f2c9b166cc09405\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "15a1520b-c93e-4b6d-82fa-34168a96d077",
        "X-Runtime": "0.017041",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]